{
  "backend/main.mo": "Main Motoko actor for the ZENTEK backend, defining user profiles, product catalog (5 hardcoded products), and order types, with access control and blob storage mixins included.",
  "feature_evidence.json": "JSON report mapping implemented features (AJIO-inspired theme, homepage layout, hardcoded product data, etc.) to their source files, components, test IDs, and confidence levels.",
  "frontend-file-summaries.txt": "Short JSON summaries of three frontend files: ProductCard, CartPage, and WishlistPage components.",
  "frontend/index.css": "Global CSS entry point that sets up Tailwind directives and defines CSS custom properties for light and dark theme color tokens.",
  "frontend/index.html": "Minimal HTML shell for the ZENTEK React app, mounting the app into a root div and loading the main TypeScript entry point.",
  "frontend/src/App.tsx": "Root React component that configures TanStack Router with all app routes (home, product, cart, wishlist, checkout, orders, auth) and wraps the app in Auth, Cart, and Wishlist context providers.",
  "frontend/src/components/home/BankOfferStrip.tsx": "Small banner component displaying a '10% Instant Discount on HDFC Bank Cards' offer strip with a credit card icon.",
  "frontend/src/components/home/HeroCarousel.tsx": "Auto-advancing hero image carousel with three slides (Mega Sale, Tech Essentials, Bank Offer), navigation arrows, dot indicators, and gradient overlay text.",
  "frontend/src/components/layout/Footer.tsx": "Site footer with four columns (Customer Care, Returns, Privacy Policy, Contact) on a dark background, plus a bottom bar with the ZENTEK brand and copyright.",
  "frontend/src/components/layout/Header.tsx": "Sticky top navigation header with logo, decorative search bar, wishlist/cart icon badges, and an authenticated user dropdown menu with logout and order navigation.",
  "frontend/src/components/layout/Layout.tsx": "Root layout component that composes OfferStrip, Header, a main content Outlet, and Footer into a full-page flex column.",
  "frontend/src/components/layout/OfferStrip.tsx": "Thin red banner displayed at the top of the page advertising free delivery, COD availability, and secure payments.",
  "frontend/src/components/product/ProductCard.tsx": "Reusable product card displaying image, discount badge, price, wishlist toggle, and an add-to-cart button with brief visual feedback.",
  "frontend/src/contexts/AuthContext.tsx": "React context providing mock authentication (signup, login, logout) backed by localStorage with a simulated JWT token.",
  "frontend/src/contexts/CartContext.tsx": "React context managing cart state (add, update quantity, remove, clear) with localStorage persistence and derived totals.",
  "frontend/src/contexts/WishlistContext.tsx": "React context managing a wishlist of product IDs with toggle/add/remove helpers and localStorage persistence.",
  "frontend/src/data/products.ts": "Static product catalog of five items with helper functions for lookup, discount calculation, and INR price formatting.",
  "frontend/src/hooks/useActor.ts": "Custom hook that creates and caches an ICP backend actor (anonymous or authenticated via Internet Identity) using React Query, invalidating dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context and hook for Internet Identity authentication using DFINITY's AuthClient, exposing login/logout functions, identity state, and login status.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for fetching products, a single product, user orders, and creating orders via the backend actor.",
  "frontend/src/index.css": "Global CSS file that imports Google Fonts, sets up Tailwind directives, and defines ZENTEK brand CSS custom properties for light and dark themes.",
  "frontend/src/main.tsx": "Application entry point that renders the React app wrapped with QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/pages/CartPage.tsx": "Shopping cart page that displays cart items with quantity controls, calculates totals and delivery charges, and allows users to select a payment method before proceeding to checkout.",
  "frontend/src/pages/CheckoutPage.tsx": "Multi-step checkout page that collects a delivery address, selects a payment method, places an order via the backend (if authenticated), and stores order history in localStorage.",
  "frontend/src/pages/HomePage.tsx": "Home page that renders a hero carousel, bank offer strip, featured product grid, and a 'Why ZENTEK' feature highlights section.",
  "frontend/src/pages/LoginPage.tsx": "Login page with an email/password form that authenticates users via the AuthContext and redirects to the home page on success.",
  "frontend/src/pages/OrderHistoryPage.tsx": "Displays a list of past orders stored in localStorage, showing order ID, date, items, payment method, and total. Redirects unauthenticated users to the login page and shows an empty state if no orders exist.",
  "frontend/src/pages/OrderSuccessPage.tsx": "Confirmation page shown after a successful order, displaying the order ID, estimated delivery info, and links to continue shopping or view order history.",
  "frontend/src/pages/ProductDetailsPage.tsx": "Shows full details for a single product including image, price, discount, description, and key features, with add-to-cart, buy-now, and wishlist toggle actions.",
  "frontend/src/pages/SignupPage.tsx": "Registration form that collects name, email, and password, validates inputs, calls the auth context signup method, and redirects to home on success.",
  "frontend/src/pages/WishlistPage.tsx": "Renders the user's wishlisted products in a grid with options to add each item to the cart or remove it from the wishlist, with an empty state fallback.",
  "frontend/src/utils/urlParams.ts": "Utility module providing functions to read URL query parameters (supporting both standard and hash-based routing), persist them in sessionStorage, and clean sensitive parameters from the URL hash.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration for the frontend, extending the default theme with custom fonts (Inter, Poppins), OKLCH-based color tokens, brand red colors, box shadows, border radii, and accordion/slide-in keyframe animations. Includes the typography, container-queries, and tailwindcss-animate plugins.",
  "project_state.json": "Project state descriptor for ZENTEK, an AJIO-style e-commerce assignment built with React/Vite/TailwindCSS frontend and Node.js/Express/MongoDB backend, documenting architecture notes, existing features, image requirements, and the 5 hardcoded tech products with Razorpay and COD payment support."
}